r-warlocks/app/controllers/registration_controller.rb

SELECT * FROM "users" WHERE ("users"."userid" = E'duplicate' AND "users"."password" = E'passw0rd') LIMIT 1
---
  def login
	if request.post?
		@user = User.find_by_userid_and_password(params[:user][:userid], params[:user][:password])

INSERT INTO "users" ("updated_at", "userid", "password", "created_at") VALUES('2008-12-23 20:19:22.595000', E'newUser', E'passw0rd', '2008-12-23 20:19:22.595000') RETURNING "id"
---
  def new
    @user = User.new(params[:user])
    if @user.save